/* Append2File
Append "Hello World!" to the FileStream "TempFile".
*/
Append2File:
output="file:///TempFile"
CALL Lineout output, "Hello World!"
